print("Сахнюк Костянтин Олександрович \nKM-71")
G1 = int(input("Введіть кількість учнів першої групи"))
G2 = int(input("Введіть кількість учнів другої групи"))
G3 = int(input("Введіть кількість учнів третьої групи"))
if (G1 + G2 + G2)/2 == int((G1 + G2 + G3)/2):   #Якщо сума учнів, поділена на 2, дрівнює цілому числу, то:
 K = (G1 + G2 + G3)/2   #Кількість столів підраховується за формулою
else:   #Якщо сума учнів, поділена на 2, не дрівнює цілому числу, то:
 K = int((G1 + G2 + G3)/2) + 1   #Кількість столів підраховується за формулою
print("Необхідно придбати столів:", K)   #Виведення відповіді на екран