print("Сахнюк Костянтин Олександрович \nKM-71")
N = int(input("Введіть кількість хвилин, відрахованих після півночі"))   #Введення кількості хвилин
if N > 60:   #Якшо кількість хвилин більша за 60, то:
 G = int(N/60)   #Кількість годин
 N = N - 60*G   #Кількість хвилин
 while G > 23:   #Поки кількість годин більша за 23:
  G = G - 24   #Кількість годин
 while N > 59:   #Поки кількість хвилин більша за 59:
  N = N -60   #Кількість хвилин
 print(G,":", N)   #Виведення відповіді на екран, якщо кількість хвилин більша за 60
else:
 print(0,":", N)   #Виведення відповіді на екран, якщо кількість хвилин менша за 60